sophmintaii/smart_heat_meter/BLE_CPU_Temperature_Measurement/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "BLE_gatt.h"
#include "BLE.h"
#include "BLE_bas.h"
#include "BLE_HAL_PVT.h"
#include "BLE_STACK_PVT.h"
#include "BLE_StackGap.h"
#include "BLE_StackGatt.h"
#include "BLE_StackGattDb.h"
#include "BLE_StackHostMain.h"
#include "BLE_StackL2cap.h"
#include "BLE_dis.h"
#include "BLE_StackGattServer.h"
#include "BLE_StackGattClient.h"
#include "BLE_Stack.h"
#include "BLE_eventHandler.h"
#include "BLE_hts.h"
#include "ADC.h"
#include "Vref.h"
#include "Vref_aliases.h"
#include "Disconnect_LED.h"
#include "Disconnect_LED_aliases.h"
#include "Advertising_LED.h"
#include "Advertising_LED_aliases.h"
#include "LowPower_LED.h"
#include "LowPower_LED_aliases.h"
#include "SW2.h"
#include "SW2_aliases.h"
#include "UART_DEB.h"
#include "UART_DEB_SPI_UART.h"
#include "UART_DEB_PINS.h"
#include "UART_DEB_SPI_UART_PVT.h"
#include "UART_DEB_PVT.h"
#include "UART_DEB_BOOT.h"
#include "DieTemp.h"
#include "Wakeup_Interrupt.h"
#include "WDT_Interrupt.h"
#include "BLE_bless_isr.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "UART_DEB_SCBCLK.h"
#include "UART_DEB_tx.h"
#include "UART_DEB_tx_aliases.h"
#include "UART_DEB_rx.h"
#include "UART_DEB_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

